Repository: frogogo/WhiteLabel-iOS
Catalog: WhiteLabel-iOS/Assets/*.lproj/Localizable.strings
Languages: ru

# auth.phone_enter_screen.title
source: Enter
ru: Вход

# auth.phone_enter_screen.hint
source: Enter your phone number
ru: Введите номер телефона

# auth.phone_enter_screen.continue_button.title
source: Continue
ru: Продолжить

# auth.phone_enter_screen.retry_button.title
source: Retry
ru: Повторить

# auth.phone_enter_screen.error.incorrect_phone_number
source: Check entered phone number.
ru: Проверьте номер телефона.

# auth.auth_code_enter_screen.title
source: Type code
ru: Введите код

# auth.auth_code_enter_screen.hint
source: The code was sent to the number
ru: Код отправлен на номер

# auth.auth_code_enter_screen.change_phone_number_button.title
source: Edit
ru: Изменить

# auth.auth_code_enter_screen.request_new_code_button.title
source: Send a new code
ru: Выслать новый код

# auth.auth_code_enter_screen.retry_time_text
source: You can request code again after:
ru: Повторно запросить код можно через:

# auth.name_enter_screen.title
source: Let’s meet!
ru: Давайте познакомимся!

# auth.name_enter_screen.hint
source: What is your name?
ru: Как вас зовут?

# auth.name_enter_screen.name_enter_field.placeholder
source: Your name
ru: Имя

# auth.name_enter_screen.сontinue_button.title
source: Сontinue
ru: Продолжить

# auth.name_enter_screen.error.name_is_empty_or_contain_spaces
source: Name must not be empty or contain spaces
ru: Имя не должно быть пустым

# auth.email_enter_screen.greetings
source: Fine,
ru: Отлично,

# auth.email_enter_screen.hint
source: It remains to enter your email
ru: Осталось ввести email

# auth.email_enter_screen.email_enter_field.placeholder
source: Your email address
ru: Ваш email

# auth.email_enter_screen.сontinue_button.title
source: Сontinue
ru: Продолжить

# auth.email_enter_screen.error.incorrect_email
source: This email not correct
ru: Такой email не подойдёт

# home.home_empty_screen.instruction_section_header.title
source: Remember 2 simple rules
ru: Правила акции

# home.home_empty_screen.product_section_header.title
source: Promotional products
ru: Товары участвующие в акции

# home.home_empty_screen.scan_button.title
source: Scan the receipt
ru: Сканировать чек

# home.home_screen.product_section_header.title
source: Promotional products
ru: Товары участвующие в акции

# home.home_screen.coupon_section_header.title
source: Coupons
ru: Купоны

# home.home_screen.coupon_cell.coupon_number
source: Coupon №
ru: Купон №

# home.home_screen.see_receipt_list_button.title
source: My receipts
ru: Мои чеки

# home.home_screen.scan_warning_cell.hint_text
source: When your receipt passes verification, you will be able to scan a new receipt
ru: Когда ваш чек пройдет проверку, вы сможете отсканировать новый чек

# home.home_screen.scan_button.title
source: Scan the receipt
ru: Сканировать чек

# coupon.coupon_detail_screen.coupon_number
source: Coupon №
ru: Купон №

# coupon.coupon_detail_screen.instruction_title
source: Instructions for receiving
ru: Инструкция по получению

# coupon.coupon_detail_screen.show_code_button.title
source: Show the code to the cashier
ru: Показать код кассиру

# coupon.coupon_barcode_screen.hint
source: Show this code to the cashier
ru: Покажите штрихкод кассиру

# qr_code_scanner_screen.hint
source: Point the camera at the QR code on the receipt
ru: Наведите камеру на QR код на чеке

# qr_code_scanner_screen.help_button.title
source: Help
ru: Помощь

# camera_access_alert.title
source: Camera access
ru: Доступ к камере

# camera_access_alert.hint
source: To scan receipts, access to the camera is required
ru: Требуется доступ к камере для сканирования QR-кода

# camera_access_alert.ok_button.title
source: Allow
ru: Разрешить

# camera_access_alert.deny_button.title
source: Deny
ru: Запретить

# receipt_list_screen.title
source: My receipts
ru: Мои чеки

# receipt_list_screen.receipt_cell.status.approved
source: Approved
ru: Принят

# receipt_list_screen.receipt_cell.status.processing
source: Processing
ru: Проверяется

# receipt_list_screen.receipt_cell.status.rejected
source: Rejected
ru: Отклонен

# receipt_list_screen.receipt_cell.status.unknown
source: Unknown
ru: Неизвестно

# receipt_screen.status.approved.title
source: Great, the receipt has been accepted!
ru: Поздравляем, чек принят!

# receipt_screen.status.processing.title
source: Your receipt is being checked
ru: Ваш чек находится на проверке

# receipt_screen.status.processing.description
source: This usually takes a few minutes, but it is very rare when it takes more of time.
ru: Обычно это занимает несколько минут, но очень редко на это уходит много времени. Когда ваш чек пройдет проверку, вы сможете отсканировать новый.

# receipt_screen.status.rejected.title
source: Your receipt has not been verified!
ru: Ваш чек не прошел проверку!

# profile_screen.version_prefix
source: Version
ru: Версия

# profile_screen.logout_button.title
source: Sign out
ru: Выход

# common.promotion_item_cell.coupon_hint
source: Coupon
ru: Купон

# error.unknown
source: Something went wrong!
ru: Что-то пошло не так!
